## [ DataFrame 인덱스 다루기 ]

- (1) 모듈 로딩 <hr>

In [266]:
import pandas as pd

- (2) 데이터 준비 <hr>

In [267]:
exam = {'이름' : [ '마징가', '배트맨', '홍길동','임꺽정'],
'국어' : [ 98, 79, 99, 100],
'미술' : [ 70, 99, 87, 80],
'수학' : [ 77, 70, 98, 72],
'체육' : [ 77, 93, 69, 91]}

- (3) 데이터 저장

In [268]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [269]:
examDF

    이름   국어  미술  수학  체육
0  마징가   98  70  77  77
1  배트맨   79  99  70  93
2  홍길동   99  87  98  69
3  임꺽정  100  80  72  91

- 행 데이터 추가

In [270]:
# 혜인 77 50 60 27 추가하라
examDF.loc[4]=['마징가',98,50,60,77]

In [271]:
# 혜인 77 59 27 79 추가하라
examDF.loc[5]=['마징가', 98,87,70,91]

In [272]:
examDF

    이름   국어  미술  수학  체육
0  마징가   98  70  77  77
1  배트맨   79  99  70  93
2  홍길동   99  87  98  69
3  임꺽정  100  80  72  91
4  마징가   98  50  60  77
5  마징가   98  87  70  91

- (5) 새로운 인덱스 설정 - 방법3: 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2, ...,컬럼n])

In [273]:
# 이름, 국어, 수학을 인덱스 설정
examDF1 = examDF.set_index(['이름', '국어', '수학']) 
# 점수가 같으믄 안나옴요
examDF1

            미술  체육
이름  국어  수학
마징가 98  77  70  77
배트맨 79  70  99  93
홍길동 99  98  87  69
임꺽정 100 72  80  91
마징가 98  60  50  77
        70  87  91

In [274]:
# 인덱스 속성 확인
examDF1.index          #멀티인덱스가 나옴

MultiIndex([('마징가',  98, 77),
            ('배트맨',  79, 70),
            ('홍길동',  99, 98),
            ('임꺽정', 100, 72),
            ('마징가',  98, 60),
            ('마징가',  98, 70)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF객체변수명.loc[행레이블] / DF객체변수명.iloc[위치인덱스]

In [275]:
examDF1.loc[('마징가',  98, 77)]

미술    70
체육    77
Name: (마징가, 98, 77), dtype: int64

In [276]:
examDF1.loc[('마징가',  98, 70)]

미술    87
체육    91
Name: (마징가, 98, 70), dtype: int64

In [277]:
examDF1.loc[('마징가',  98, 60)]       # 위 셋은 같은 마징가라도 다 다르다.

미술    50
체육    77
Name: (마징가, 98, 60), dtype: int64

In [278]:
# KeyError 발생 => ('마징가',  98, 77)
# examDF1.loc[(98)]

- 멀티인덱스의 인덱스의 일부분을 기준으로 행 선택 : xs
    * 예) '마징가' 98 77 => level 0 1 2 (각각에 레벨이 있다)

In [279]:
examDF1.xs('마징가', level = 0) 
#메소드이면 대괄호가 들어가는데 얘는 함수라 괄호 ㅇㅇ
#멀티인덱스에 레벨이 존재한다. 여기서는 0 1 2 이르케 3단계
#아까 마징가가 3개였다. 그 셋은 국어점수가 98로 같았다.

       미술  체육
국어 수학
98 77  70  77
   60  50  77
   70  87  91

In [280]:
#examDF1.xs(98)
#기본값이 level = 0이라 에러발생

In [281]:
examDF1.xs(98, level = 1)

        미술  체육
이름  수학
마징가 77  70  77
    60  50  77
    70  87  91

In [282]:
examDF1.xs(70, level = 2)
#앞에 이름이 달라도 2레벨 인덱스에서 찾아서 내놓음

        미술  체육
이름  국어
배트맨 79  99  93
마징가 98  87  91

-  ('마징가',  98, 77), ('임꺽정', 100, 72) 이 둘을 한꺼번에 가져오기

In [283]:
examDF1.loc[[('마징가', 98, 77), ('임꺽정', 100, 72)]]

            미술  체육
이름  국어  수학
마징가 98  77  70  77
임꺽정 100 72  80  91

- (5) 인덱스 재배치 : 행/열 인덱스를 원하는 순서대로 재배치 + 존재하지 않는 행/열 추가
    * DF.reindex()

In [284]:
print(examDF.index, examDF.columns, sep='\n\n')

Index([0, 1, 2, 3, 4, 5], dtype='int64')

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학','총합'

In [285]:
examDF.reindex(['체육', '미술', '국어', '수학','총합'], axis = 'columns')
#원래는 행우선이라 axis를 설정해줘야 컬럼이 바뀜
#복사본이라 원본이 바뀌지 않는다.

   체육  미술   국어  수학  총합
0  77  70   98  77 NaN
1  93  99   79  70 NaN
2  69  87   99  98 NaN
3  91  80  100  72 NaN
4  77  50   98  60 NaN
5  91  87   98  70 NaN

In [286]:
examDF.reindex(['체육', '미술', '국어', '수학','총합'], axis = 'columns',fill_value=0)

   체육  미술   국어  수학  총합
0  77  70   98  77   0
1  93  99   79  70   0
2  69  87   99  98   0
3  91  80  100  72   0
4  77  50   98  60   0
5  91  87   98  70   0

- 행 인덱스 재배치 [0,2,4,1,3,5]

In [287]:
examDF.reindex([0,2,4,1,3,5], axis = 'index',fill_value=0)

    이름   국어  미술  수학  체육
0  마징가   98  70  77  77
2  홍길동   99  87  98  69
4  마징가   98  50  60  77
1  배트맨   79  99  70  93
3  임꺽정  100  80  72  91
5  마징가   98  87  70  91

- 컬럼명 순서 병경 => ['체육', '미술', '국어', '수학','총합']  +   행인덱스 => [0,2,4,1,3,5] 재배치

In [288]:
examDF.reindex(index=[0,2,4,1,3,5],columns=['체육', '미술', '국어', '수학','총합'],fill_value=0)
#여기서 axis의 값은 의미가 없다.

   체육  미술   국어  수학  총합
0  77  70   98  77   0
2  69  87   99  98   0
4  77  50   98  60   0
1  93  99   79  70   0
3  91  80  100  72   0
5  91  87   98  70   0